Terraform plan for __stage__
```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo-cicd.aws_s3_bucket.demo must be replaced
-/+ resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::stage-cicd-demo-bucket" -> (known after apply)
      ~ bucket                      = "stage-cicd-demo-bucket" -> "stage-demo-bucket" # forces replacement
      ~ bucket_domain_name          = "stage-cicd-demo-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "stage-cicd-demo-bucket.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "**************" -> (known after apply)
      ~ id                          = "**********************" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...
```
Plan generated in [Terraform PR #30](https://github.com/codigube/github-actions-terraform/actions/runs/349167833)